{"id":126,"date":"2023-09-26T10:54:09","date_gmt":"2023-09-26T10:54:09","guid":{"rendered":"https:\/\/co2.fpoko.com\/?p=23"},"modified":"2024-02-23T01:42:10","modified_gmt":"2024-02-23T01:42:10","slug":"best-fully-funded-canadian-government-scholarships","status":"publish","type":"post","link":"https:\/\/fpoko.com\/scholarships\/best-fully-funded-canadian-government-scholarships\/","title":{"rendered":"Best Fully Funded Canadian Government Scholarships"},"content":{"rendered":"<p>Lester B. Pearson Scholarship is one of the fully funded Canadian government scholarships you can apply for online for free. There are quite a number of government-sponsored, partnered, and private fully-funded scholarships available for Canadian students and international students seeking to study in Canada and we have listed some of them below with details.<\/p>\n<p>Are you a Canadian or international student that wants to study in Canada through a scholarship? This article could be what you need to get started with a fully-funded scholarship.<\/p>\n<h2>About Fully Funded Canadian Government Scholarships<\/h2>\n<h3><strong>MASTERCARD FOUNDATION SCHOLARSHIP – UNIVERSITY OF BRITISH COLOMBIA<\/strong><\/h3>\n<p>The MasterCard foundation partners with the University of British Colombia to provide fully-funded scholarships to both Canadian citizens and foreigners. The interested student gets to pick a field of their choice or course to study at the University of Colombia.<\/p>\n<h3><strong>LESTER B. PEARSON SCHOLARSHIPS<\/strong><\/h3>\n<p>The Lester B. Pearson scholarship is the most sort after fully funded Canadian government scholarships that offer about 40 scholarships to undergraduates that want to study at the University of Toronto and yes, you get to go for a course of your choice.<\/p>\n<p>While the Lester B scholarship is mostly for international students, Canadian students can obtain free student loans and grants through the Canadian government at the university.<\/p>\n<h3><strong>UNIVERSITY OF MANITOBA SCHOLARSHIPS<\/strong><\/h3>\n<p>This scholarship is fully funded and granted only to students who want to major in a Master’s degree or Ph.D. program at the University of Manitoba and you get to choose any field of your choice.<\/p>\n<p>The scholarship awards are valued at $14,000 per year for 12 or 24 months, up to a total of $28,000 and they are awarded to only admitted masters or Ph.D. students.<\/p>\n<h3><strong>VANIER CANADA GRADUATE SCHOLARSHIPS<\/strong><\/h3>\n<p>Also known as Vanier CGS, it is a fully-funded Canadian government scholarship awarded to both Canadian citizens and international students but it is only meant for Master’s degree and Ph.D. programs.<\/p>\n<p>For doctoral studies, the scholarship is valued at $50,000 per year for up to 3 years of study.<\/p>\n<p>This scholarship is in honor of the first francophone Governor General of Canada and it is open to receive applications from both Canadian and international students.<\/p>\n<h3><strong>YORK UNIVERSITY<\/strong> SCHOLARSHIPS<\/h3>\n<p>The Global Leaders of Tomorrow Scholarships collaborating with York University is a fully-funded scholarship program awarded to international students to study for a bachelor’s degree at the University of York and students get to choose their preferred field of study.<\/p>\n<p>There are a number of scholarships available to Canadian and international students who want to study at the York University. These scholarship opportunities are so broad that almost every student applying to the university has a category he or she is eligible to apply for.<\/p>\n<h3><strong>HUMBER COLLEGE SCHOLARSHIPS<\/strong><\/h3>\n<p>This scholarship is fully funded for international students to study for a Bachelor’s degree program in Canada for any field of their choice.<\/p>\n<h2><strong>UNIVERSITY OF CALGARY SCHOLARSHIPS<\/strong><\/h2>\n<p>International students can take up this scholarship offer awarded by the University of Calgary, it is fully funded and students get to choose a course of study from a wide range of courses offered by the university.<\/p>\n<h3><strong>PIERRE ELLIOT TRUDEAU FOUNDATION DOCTORAL SCHOLARSHIPS<\/strong><\/h3>\n<p>This scholarship grant is fully funded and even comes with a stipend but it is only awarded to just 15 Ph.D. Canadian and international students.<\/p>\n<h3><strong>ALGONQUIN COLLEGE UNDERGRADUATE SCHOLARSHIPS<\/strong><\/h3>\n<p>This is a fully-funded Canadian scholarship program open to students of every nationality to study their preferred course in Algonquin college and get a bachelor’s degree.<\/p>\n<h3><strong>QUEST UNIVERSITY SCHOLARSHIPS FOR UNDERGRADUATE<\/strong><\/h3>\n<p>This scholarship is specially awarded to students who have been known to contribute positively in their local communities or schools, so as a reward for their achievement they are awarded this scholarship to study a bachelor’s degree on any course of their choice.<\/p>\n<p><a href=\"https:\/\/questu.ca\/admissions\/afford\/scholarships\/#1472773290267-d8f221fc-dc67\" target=\"_blank\" rel=\"noopener\"><strong>Apply here<\/strong><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Lester B. Pearson Scholarship is one of the fully funded Canadian government scholarships you can apply for online for free. There are quite a number of government-sponsored, partnered, and private fully-funded scholarships available for Canadian students and international students seeking to study in Canada and we have listed some of them below with details. Are [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":110,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"cybocfi_hide_featured_image":"","footnotes":""},"categories":[11],"tags":[],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts\/126"}],"collection":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/comments?post=126"}],"version-history":[{"count":1,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts\/126\/revisions"}],"predecessor-version":[{"id":181,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts\/126\/revisions\/181"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/media\/110"}],"wp:attachment":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/media?parent=126"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/categories?post=126"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/tags?post=126"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}