{"id":251,"date":"2024-03-24T07:19:14","date_gmt":"2024-03-24T07:19:14","guid":{"rendered":"https:\/\/fpoko.com\/?p=251"},"modified":"2024-03-24T07:19:14","modified_gmt":"2024-03-24T07:19:14","slug":"university-of-calgary-scholarships-for-international-students-2023-2024-canada","status":"publish","type":"post","link":"https:\/\/fpoko.com\/scholarship\/university-of-calgary-scholarships-for-international-students-2023-2024-canada\/","title":{"rendered":"University of Calgary Scholarships for International Students 2023\/2024, Canada"},"content":{"rendered":"<p>So you want to study in Canada, but you need a scholarship? You came to the right place! We’re going to tell you all about the scholarships offered by the University of Calgary.<\/p>\n<p>The University of Calgary is offering scholarships for international students that will be joining the first year of any undergraduate program in the fall. How much? Twenty thousand dollars renewable annually.<br \/>\nThe University of Calgary International Scholarship is a prestigious program that rewards the great achievements of international students who are about to embark on the journey of undergraduate studies.<\/p>\n<p>At the University of Calgary, students are given an education that is up to high international standards with the aim of preparing them for success in life. They also have the opportunity to engage in research that deals with persistent challenges that society must face.<\/p>\n<h4 class=\"wp-block-heading\">Scholarship Summary<\/h4>\n<ul>\n<li><strong>Level of Study:<\/strong> Undergraduate<\/li>\n<li><strong>Institution: <\/strong>University of Calgary<\/li>\n<li>C<strong>ountry of study: <\/strong>Canada<\/li>\n<li><strong>Deadline: <\/strong>visit this website to check deadlines, https:\/\/www.ucalgary.ca\/future-students\/undergraduate\/how-apply\/dates<\/li>\n<li><strong>Program Period:<\/strong> varies depending on the selected Bachelor program.<\/li>\n<\/ul>\n<p><strong>Courses Offered<\/strong><\/p>\n<p>The scholarships offered by the University of Calgary for undergraduate students cover a wide array of programs. We encourage students to visit the link below to find a suitable program. There is a multitude of choices, so you will certainly be able to find the right program for yourself.<br \/>\n<a href=\"https:\/\/www.ucalgary.ca\/future-students\/undergraduate\/explore-programs\">https:\/\/www.ucalgary.ca\/future-students\/undergraduate\/explore-programs<\/a><\/p>\n<p><strong>Scholarship Coverage<\/strong><\/p>\n<p>The University of Calgary offers two different types of Scholarships:<\/p>\n<ul>\n<li>Energizing Canada International Entrance Scholarship: $20,000 (Renewable for 3 more years under conditions).<\/li>\n<li>University of Calgary International Entrance Scholarship: $20,000 (Renewable for 3 more years under conditions).<\/li>\n<\/ul>\n<h4 class=\"wp-block-heading\">Eligibility Criteria<\/h4>\n<p>Consideration for one of the scholarships offered by the University of Calgary demands that candidates meet the following requirements. Keep in mind that each scholarship has different requirements.<\/p>\n<p>Required Language: English.<br \/>\nEligible Countries: All world countries.<br \/>\nThe Energizing Canada International Entrance Scholarship is offered to international students who are joining the first year of an undergraduate degree program at the University of Calgary. The scholarship is renewable for three more years on the condition that the student achieves at least a 3.00 GPA over at least 24.00 units in the preceding fall and winter terms.<\/p>\n<p>This scholarship is awarded on the basis of academic merit as well as financial need. Applicants must have graduated from a recognized high school in China, Hong Kong, or Macau. Students entering a Bachelor of Engineering, a Bachelor of Commerce, a Bachelor of Health Sciences, or a Bachelor of Arts – Urban Studies program are given preference.<\/p>\n<p>The University of Calgary International Entrance Scholarship is offered annually to undergraduate international students who will be joining the first year of any undergraduate program in the fall term. Applicants must fulfill the English language proficiency requirement of the university. The scholarship is renewable for three more years under the condition that the recipients hold a 2.60 GPA at least over no less than 24.00 units in the previous fall and winter terms. The students must also keep paying an international differential tuition fee since they are international students. Students who are not Canadian citizens or permanent residents of Canada may apply for this scholarship.<\/p>\n<h4 class=\"wp-block-heading\">What is the application process?<\/h4>\n<p>If you wish to apply for this scholarship, then you have to follow these steps:<\/p>\n<p><strong>(1) Apply for the undergraduate program of your choice at the university:<\/strong><\/p>\n<ul>\n<li>The first step in the application process is to create a UCalgary eID.<\/li>\n<li>You can refer to the application guide on the website if you have any questions about the application process.<\/li>\n<li>The application requires the payment of an application fee of one hundred and forty-five Canadian dollars (145$).<\/li>\n<li>Once your application has been received and viewed, the Calgary Student Center will provide you with information on how and where to submit any required documents. You can visit the documents page on the website for additional information.<\/li>\n<\/ul>\n<p><strong>(2) To apply for the Scholarship, you have to follow these steps:<\/strong><\/p>\n<ul>\n<li>Use the myUofC portal to access your Student Center.<\/li>\n<li>Go to the “My Financials” page.<\/li>\n<li>Find the “Awards and Scholarships” section. Go to “Apply for Undergraduate Awards”. Check that your navigator enables pop up windows. If pop up windows are blocked, you will not have access to the page.<\/li>\n<li>Once a window is open on your navigator, you will be able to look for available applications and deadlines for applications.<\/li>\n<\/ul>\n<h4 class=\"wp-block-heading\">Website<\/h4>\n<p>If you need more information, feel free to access the official website.<\/p>\n<ul>\n<li>Energizing Canada International Entrance Scholarship: <a href=\"https:\/\/ucalgary.ca\/registrar\/awards\/energizing-canada-international-entrance-scholarship\">https:\/\/ucalgary.ca\/registrar\/awards\/energizing-canada-international-entrance-scholarship<\/a><\/li>\n<li>University of Calgary International Entrance Scholarship: <a href=\"https:\/\/ucalgary.ca\/registrar\/awards\/university-calgary-international-entrance-scholarship\">https:\/\/ucalgary.ca\/registrar\/awards\/university-calgary-international-entrance-scholarship<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>So you want to study in Canada, but you need a scholarship? You came to the right place! We’re going to tell you all about the scholarships offered by the University of Calgary. The University of Calgary is offering scholarships for international students that will be joining the first year of any undergraduate program in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":252,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"cybocfi_hide_featured_image":"","footnotes":""},"categories":[6],"tags":[],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts\/251"}],"collection":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/comments?post=251"}],"version-history":[{"count":1,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts\/251\/revisions"}],"predecessor-version":[{"id":253,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/posts\/251\/revisions\/253"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/media\/252"}],"wp:attachment":[{"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/media?parent=251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/categories?post=251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fpoko.com\/wp-json\/wp\/v2\/tags?post=251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}